26-rails-api/movies-api/app/controllers/api/v1/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE "movies"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "movies" SET "score" = $1, "updated_at" = $2 WHERE "movies"."id" = $3  [["score", 20], ["updated_at", "2020-03-16 15:04:41.876753"], ["id", 1]]
---
  def update
    movie = Movie.find(params[:id])

    movie.update(movie_params)