29-object-oriented-javascript/movies-api/app/controllers/api/v1/movies_controller.rb

  def create
    movie = Movie.create(movie_params)
---
INSERT INTO "movies" ("score", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["score", 20], ["created_at", "2020-03-16 14:57:32.380645"], ["updated_at", "2020-03-16 14:57:32.380645"]]

  def update
    movie = Movie.find(params[:id])

    movie.update(movie_params)
---
SELECT "movies".* FROM "movies" WHERE "movies"."id" = $1 LIMIT $2  [["id", 21], ["LIMIT", 1]]
UPDATE "movies" SET "score" = $1, "updated_at" = $2 WHERE "movies"."id" = $3  [["score", 1], ["updated_at", "2020-03-17 17:41:07.719264"], ["id", 21]]