16-rails-session/app/controllers/application_controller.rb

SELECT  "nachos".* FROM "nachos" WHERE "nachos"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
  def get_items_from_cart
    @cart_items = Nacho.find(cart)