16-rails-session/app/controllers/nachos_controller.rb

  def index # /nachos
    @nachos = Nacho.all
---
SELECT "nachos".* FROM "nachos"

  def find_nacho
    @nacho = Nacho.find(params[:id])
---
SELECT  "nachos".* FROM "nachos" WHERE "nachos"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]